In [1]:
import numpy as np
import pandas as pd
from sklearn.datasets import load_iris

In [37]:
# Q.I: Operations on the Iris dataset
iris = load_iris()
iris_data = iris.data
data_i=pd.read_csv("iris.csv")
feature_names = iris.feature_names
print("Feature names:", feature_names)

Feature names: ['sepal length (cm)', 'sepal width (cm)', 'petal length (cm)', 'petal width (cm)']

1. Find all rows from iris data petal length (3rd column) > 1.5 and sepal length (1st column) <5.0

In [3]:
condition = (iris_data[:, 2] > 1.5)&(iris_data[:, 0] < 5.0) 
filtered_rows = iris_data[condition]
print(filtered_rows)

[[4.8 3.4 1.6 0.2]
 [4.8 3.4 1.9 0.2]
 [4.7 3.2 1.6 0.2]
 [4.8 3.1 1.6 0.2]
 [4.9 2.4 3.3 1. ]
 [4.9 2.5 4.5 1.7]]

In [4]:
# 2. Find min, max and standard deviation of sepal length (1st column)

sepal_length = iris_data[:, 0]
min_sepal = sepal_length.min()
max_sepal = sepal_length.max()
std_sepal = sepal_length.std()

print("min:", min_sepal)
print("max:", max_sepal)
print("std:", std_sepal)

min: 4.3
max: 7.9
std: 0.8253012917851409

In [5]:
# 3. Normalize the sepal length values so they range exactly from 0 to 1.
normalized_sepal = (sepal_length - min_sepal) / (max_sepal - min_sepal)
print("normalized sepal lengths (0 to 1):")
print(normalized_sepal[:10])

normalized sepal lengths (0 to 1):
[0.22222222 0.16666667 0.11111111 0.08333333 0.19444444 0.30555556
 0.08333333 0.19444444 0.02777778 0.16666667]

In [6]:
# 4. insert null values randomly in the petal length column(3rd column)
nan_data=iris_data.copy()
np.random.seed(0) #basicaly seed(0) is use when we create a random number but we want to keep the random number genrated same as every time we run the code ,if we do not use the random.seed(0) the code we run will genrate every time new random numbers. 
num=15 # inserting n15 null values in the nan_data in these block we create the deep copy of the iris data rather than creating the shallow copy. 
rand_indices=np.random.choice(nan_data.shape[0],num,replace=False) #np.random.choice select the random number from the array in these line we .shape[0] gives total number f the rows and replace=False insure that selected indices is not repeated again
nan_data[rand_indices]=np.nan
print("Nan data inserted into the petal length:",rand_indices)

Nan data inserted into the petal length: [114  62  33 107   7 100  40  86  76  71 134  51  73  54  63]

In [7]:
#5. find position(row indices) of the  namn value in the petal length column.
missing_val=np.where(np.isnan(nan_data[:,2]))
print(missing_val)

(array([  7,  33,  40,  51,  54,  62,  63,  71,  73,  76,  86, 100, 107,
       114, 134], dtype=int64),)

In [8]:
#6 drop all the rows from the iris dataset with Nan values
new_iris_data=nan_data[~np.isnan(nan_data).any(axis=1)] # we created a new_iris_data and np.nan will make the true where nan is avalable and .any(axis=1) will check the each row that consis of then "true" ~ is a not oprator in thse case it will invert the false-->true and true__>false so where there is false that row will be negilated.axis=1 means we will aply the opration row wise applyin it on every row if it is axis=0 will be applied column wise
print("before droping nan values=",nan_data.shape)
print("after droping nan values=",new_iris_data.shape)

before droping nan values= (150, 4)
after droping nan values= (135, 4)

In [38]:
#7. How to count unique values of species.

species_counts = data_i['pecies'].value_counts()
print("species count",species_counts)

KeyError: 'species'

In [10]:
#2. Display Number of Rows per Species with NumPy

Q.II Create a dataframe using following details:

Rollno, Name, ContactNo, Gender, Course Name.Marks

In [11]:
#1. Add 10 records.
student_data = {
    'Rollno': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'Name': ['Alice', 'Bob', 'Alena', 'Kartik', 'Ankita', 'Eikta', 'Akruti', 'Avinash', 'dhruv', 'DJ'],
    'ContactNo': ['1234567890', '2345678901', '3456789012', '4567890123', '5678901234', '6789012345', '7890123456', '8901234567', '9012345678', '0123456789'],
    'Gender': ['F', 'M', 'F', 'M', 'F', 'F', 'F', 'M', 'M', 'F'],
    'Course': ['Computer Science', 'Robotics', 'Genomics', 'Medical Science', 'Data Science', 'Aqua Sciece', 'Life science', 'Psychology', 'Zoology', 'Neuroscience'],
    'Score': [78, 91, 90, 99, 80, 85, 76, 87, 92, 98]
}

student= pd.DataFrame(student_data)
student.head()

   Rollno    Name   ContactNo Gender            Course  Score
0       1   Alice  1234567890      F  Computer Science     78
1       2     Bob  2345678901      M          Robotics     91
2       3   Alena  3456789012      F          Genomics     90
3       4  Kartik  4567890123      M   Medical Science     99
4       5  Ankita  5678901234      F      Data Science     80

In [12]:
# 2. Display all student names starting with letter "A"
names_A = student[student['Name'].str.startswith('A')]['Name']
print("Students whose names start with 'A':")
print(names_A)

Students whose names start with 'A':
0      Alice
2      Alena
4     Ankita
6     Akruti
7    Avinash
Name: Name, dtype: object

In [13]:
# 3. Display all records whose marks are greater than 50
marks_50 = student[student['Score'] > 85]
print("students whose have marks greater than 85")
print(marks_50)

students whose have marks greater than 85
   Rollno     Name   ContactNo Gender           Course  Score
1       2      Bob  2345678901      M         Robotics     91
2       3    Alena  3456789012      F         Genomics     90
3       4   Kartik  4567890123      M  Medical Science     99
7       8  Avinash  8901234567      M       Psychology     87
8       9    dhruv  9012345678      M          Zoology     92
9      10       DJ  0123456789      F     Neuroscience     98

In [14]:
# 4. Display the records with a specific course name (neuroscience)
specific_course=student[student["Course"]=="Neuroscience"]
print("student info with specific course 'Neuroscience'")
print(specific_course)

student info with specific course 'Neuroscience'
   Rollno Name   ContactNo Gender        Course  Score
9      10   DJ  0123456789      F  Neuroscience     98

In [15]:
# 5. Display only male student records
Male_student=student[student['Gender']=="M"]
print("Male student::")
print(Male_student)
print("total number of male student in the data=",Male_student.shape[0])

Male student::
   Rollno     Name   ContactNo Gender           Course  Score
1       2      Bob  2345678901      M         Robotics     91
3       4   Kartik  4567890123      M  Medical Science     99
7       8  Avinash  8901234567      M       Psychology     87
8       9    dhruv  9012345678      M          Zoology     92
total number of male student in the data= 4

In [16]:
# 6. Display all the students whose gender is "Female" and marks greater than or equalto 90
female_student=student[(student['Gender']=='F')&(student['Score']>=90)]
print("female student with score grater tthan 90::")
print(female_student)

female student with score grater tthan 90::
   Rollno   Name   ContactNo Gender        Course  Score
2       3  Alena  3456789012      F      Genomics     90
9      10     DJ  0123456789      F  Neuroscience     98

Q.III Create a dataframe using list:

List1 is having names of employees

List 2 is having salaries of employees.

In [18]:
names = [ 'Alena', 'Kartik', 'Ankita', 'Eikta', 'Akruti', 'Avinash', 'Dhruv', 'DJ',"Abhay",'Sidharth','N/A',"N/A","N/A"]
salary= [70000, 80000, 75000, 90000, 85000,90000,87000,98000,83000,86000,82000,78000,91000]

df=pd.DataFrame({'Employe':names,
                 'Salary':salary})
df.replace('N/A',np.NaN,inplace=True)
#1.Display all the employees
df

     Employe  Salary
0      Alena   70000
1     Kartik   80000
2     Ankita   75000
3      Eikta   90000
4     Akruti   85000
5    Avinash   90000
6      Dhruv   87000
7         DJ   98000
8      Abhay   83000
9   Sidharth   86000
10       NaN   82000
11       NaN   78000
12       NaN   91000

In [19]:
#2. Clean the dataset
df.isna()

    Employe  Salary
0     False   False
1     False   False
2     False   False
3     False   False
4     False   False
5     False   False
6     False   False
7     False   False
8     False   False
9     False   False
10     True   False
11     True   False
12     True   False

In [20]:
df.isna().sum()

Employe    3
Salary     0
dtype: int64

In [21]:
df.dropna(inplace=True)
print(df)

    Employe  Salary
0     Alena   70000
1    Kartik   80000
2    Ankita   75000
3     Eikta   90000
4    Akruti   85000
5   Avinash   90000
6     Dhruv   87000
7        DJ   98000
8     Abhay   83000
9  Sidharth   86000

In [22]:
# 3.. Sort all the records on the basis of names
sorted_names = df.sort_values(by="Employe")
print("sorted names:")
print(sorted_names)

sorted names:
    Employe  Salary
8     Abhay   83000
4    Akruti   85000
0     Alena   70000
2    Ankita   75000
5   Avinash   90000
7        DJ   98000
6     Dhruv   87000
3     Eikta   90000
1    Kartik   80000
9  Sidharth   86000

In [23]:
# 4.Sort all the records on the basis of salaries
sorted_salary = df.sort_values(by="Salary")
print(" sorted Salary:")
print(sorted_salary)

 sorted Salary:
    Employe  Salary
0     Alena   70000
2    Ankita   75000
1    Kartik   80000
8     Abhay   83000
4    Akruti   85000
9  Sidharth   86000
6     Dhruv   87000
3     Eikta   90000
5   Avinash   90000
7        DJ   98000

In [30]:
# 5.Display the record of employee having highest salary
highest_salary = df.loc[df['Salary'].idxmax()]
print("highest salary:")
print(highest_salary)

highest salary:
Employe       DJ
Salary     98000
Name: 7, dtype: object

In [25]:
# Sort the DataFrame by 'Salary' in descending order and get the top 3 records
top_3= df.sort_values(by='Salary', ascending=False).head(3)

# Display the top 3 records
print(top_3)

   Employe  Salary
7       DJ   98000
3    Eikta   90000
5  Avinash   90000

In [28]:
# top 3 records with low salary
top_3= df.sort_values(by='Salary', ascending=True).head(3)

# Display the top 3 records
print(top_3)

  Employe  Salary
0   Alena   70000
2  Ankita   75000
1  Kartik   80000